<template>
  <!-- 习俗组件 -->
  <div class="Custom">
    <div class="main">
      <!-- 习俗 -->
      <div
        v-for="(item1, i1) in parallaxOptionArray"
        :key="i1"
        class="customItem"
      >
        <!-- 端午习俗 -->
        <Parallax
          :title="item1.title"
          :description="item1.description"
          :bg="item1.img"
        >
          <template #other> </template>
        </Parallax>
        <div class="Text">
          <p
            v-for="(item2, i2) in item1.customText"
            :key="i2"
            class="customText"
          >
            {{ item2 }}
          </p>
        </div>
      </div>
      <!-- 分页功能 -->
      <el-pagination
        class="flexCenter"
        background
        layout="prev, pager, next"
        :total="100"
      >
      </el-pagination>
    </div>
  </div>
</template>

<script lang="ts">
import { ref, reactive } from 'vue'

import CustomEntrance from '@/components/index/customEntrance.vue'
import Parallax from '@/components/common/parallax.vue'
export default {
  name: 'Custom',
  setup() {
    // 滚动到顶部
    document.body.scrollTop = 0
    document.documentElement.scrollTop = 0
    // 视差数据数组
    let parallaxOptionArray = [
      {
        description:
          '端午食粽，是节日习俗之一。粽，即“粽籺”，俗称“粽子”，属“籺”的其中一种。“籺”是逢年过节时用来拜神祭祖的贡品，籺有很多品种，不同的节日会做不同的籺，做籺拜神祭祖是古老习俗',
        img: require('@/assets/image/custom3.jpg'),
        title: '吃粽子',
        customText: [
          '端午食粽是我国流行范围很广的传统习俗。粽的主要材料是稻米、馅料和箬叶（或柊叶）等。包粽子所用的“植物叶子”，统称粽叶。粽子的传统形式为三角形，一般根据内瓤命名。粽子的种类，从口味上分，粽子有咸粽和甜粽两大类；从粽子馅上分，咸粽有肉粽、咸肉蛋黄粽、香菇粽、鲍鱼粽、莲子粽等，甜粽有水果粽、豆沙粽、枣子粽、香芋粽等；除了这些，还有一些地区的人爱吃碱水粽、白粽。北方粽子多是简单白米、赤豆、枣，蘸着白糖。而在南方，粽子口味丰富，鲜肉、鲜肉、火腿、蛤蒌、蛋黄、豆沙、排骨、蜜枣、莲蓉等，都能在粽子里变成可口的美味。形状多体现地域特色。',

          '粽最初是作为端午节拜神祭祖的贡品；到了晋代时已经普及到全国各地并被正式定为端午节庆食物。晋周处的《风土记》：“仲夏端午，烹鹜角黍。”用菰叶（茭白叶）包黍米成牛角状，称"角黍"；用竹筒装米密封烤熟，称"筒粽"。东汉末年，以草木灰水浸泡黍米，因水中含碱，用菰叶包黍米成四角形，煮熟，成为广东碱水粽。'
        ]
      },
      {
        description:
          '赛龙舟是中国端午节的习俗之一，也是端午节最重要的节日民俗活动之一，在中国南方地区普遍存在，在北方靠近河湖的城市也有赛龙舟习俗，而大部分是划旱龙舟舞龙船的形式',
        img: require('@/assets/image/custom1.jpg'),
        title: '赛龙舟',
        customText: [
          '“龙舟竞渡”是在战国时代就已有的习俗。战国时期，人们在急鼓声中划刻成龙形的独木舟，做竞渡游戏，以娱神与乐人，此时的龙舟竞渡是祭仪中半宗教性、半娱乐性的节目。在两湖地区，祭屈原与赛龙舟是紧密相关的。可能屈原及曹娥、伍子胥等逝去后，当地人民也曾用魂舟送其灵魂归葬，故有此俗。但赛龙舟除纪念屈原之外，在各地人们还赋予了不同的寓意。',
          '龙船竞渡前，先要请龙、祭神。如广东龙舟，在端午前要从水下起出，祭过在南海神庙中的南海神后，安上龙头、龙尾，再准备竞渡。并且买一对纸制小公鸡置龙船上，认为可保佑船平安。闽、台则往妈祖庙祭拜。有的直接在河边祭龙头，杀鸡滴血于龙头之上，如四川、贵州等个别地区。',
          '赛龙舟前会举行各种祭祀、纪念之仪式，一般都是点香烛，烧纸钱，供以鸡、米、肉、供果、粽子等。如今这些含有迷信色彩朗仪式已很少见，但在过去，人们祭祀龙神庙时气氛很严肃，多祈求农业丰收、风调雨顺、去邪祟、攘灾异、事事如意，也保佑划船平安。用人们的话说，“图个吉利”，表达人们内心良好的愿望'
        ]
      },
      {
        description:
          '佩香囊，是端午传统习俗之一。香囊内通常填充一些具有芳香开窍的中草药，有清香、驱虫、避瘟、防病的功能。',
        img: require('@/assets/image/custom2.jpg'),
        title: '佩香囊',
        customText: [
          '江南部分地方,"佩香囊"的习俗,内装香料,送给恋人,以示忠贞之心。老年人为了防病健身，一般喜欢戴梅花、菊花、桃子、苹果、荷花、娃娃骑鱼、娃娃抱公鸡、双莲并蒂等形状的，象征着鸟语花香，万事如意，夫妻恩爱，家庭和睦。小孩喜欢的是飞禽走兽类的，如虎、豹子；猴子上竽、斗鸡赶免等。青年人戴香包最讲究，如果是热恋中的情人，那多情的姑娘很早就要精心制作一二枚别致的香包，赶有节前送给自己的情郎。小伙子戴着心上人送给的香包，自然要引起周围男女的评论，直夸小伙的对象心灵手巧。',

          '所谓香囊，就是将芳香开窍的中草药如苍术、藿香、吴茱萸、艾叶、肉桂、砂仁、雄黄、冰片、樟脑等制成药末，装在特制的布袋中，外包丝布，清香四溢，再以五色丝线弦扣成索，做成各种不同形状，结成一串，形形色色，玲珑可爱，佩戴在胸前、腰际、脐中等处，有清香、驱虫、避瘟、防病的功能。香囊选用的中草药具有散风驱寒、健脾和胃、理气止痛、通九窍之功能，且大都含有挥发油，气味清香纯正、持久，多数中药有效成分对多种细菌和病毒、霉菌有不同程度的抑制或杀灭功能，从而起到了避邪驱瘟的作用。'
        ]
      },
      {
        description:
          '五色丝线，汉族节日习俗，一般在端午节佩戴五色丝线以辟邪 [1]  。端午习俗甚多，由阴阳五行术数也衍生出了一系列的辟邪习俗。',
        img: require('@/assets/image/custom4.jpg'),
        title: '系五色丝线',
        customText: [
          '五色丝线，又称五彩线、五彩长命缕、五色线、朱索、百索等。端午节系五彩长命缕，是古老的汉族传统习俗。在东晋葛洪的《抱朴子》中记述有将五色纸挂于山中，召唤五方鬼神的巫术。大概是以五色象征五方鬼神齐来护佑之意，源于我国古代的五行观念。东汉应劭《风俗通·佚文》：“午日，以五彩丝系臂，避鬼及兵，令人不病瘟，一名长命缕，一名辟兵绍”。晋人刘义庆《世说》等书，记以五色丝缠绕粽子，以投入江中，为蚊龙所惮。在后世的传承发展中，即发展成许多种漂亮好玩的香囊等饰物，制作也日趋精致，成为端午节特有的民间艺品。'
        ]
      },
      {
        description:
          '斗草，又称斗百草，是中国民间流行的一种游戏，属于端午民俗。其最初的源起已无处可寻，汉以前不见斗草之戏记载（《历代社会通俗事物考·尚秉和》），或许汉代之前此俗尚未流传入北方中原。',
        img: require('@/assets/image/custom5.png'),
        title: '斗百草',
        customText: [
          '斗草为中国民间游戏，是一种由采草药衍生而成的民间游戏，於端午日外出，找些奇花异草互相比赛，以新奇或品种多者为胜。后常用为节日郊游之典。流行于南方江南地区和北方中原地区。起源无考，普遍认为与中医药学的产生有关。远古时代先民每年端午节群出郊外采药，插艾门上，以解溽暑毒疫，衍成定俗；收获之余，往往举行比赛，以对仗形式互报花名、草名，多者为赢，兼具植物知识、文学知识之妙趣；儿童则以叶柄相勾，捏住相拽，断者为输，再换一叶相斗。汉以前不见斗草之戏（《历代社会风俗事物考·尚秉和》）。或许汉代之前此俗尚未流传入北方中原。《物原》云：“始于汉武”。据梁朝人宗懔在《荆楚岁时记》中云："五月五日，四民并踏百草，又有斗草之戏。"《年华记丽》：“端午结庐蓄药，斗百草，缠五丝。”'
        ]
      }
    ]
    return { parallaxOptionArray }
  },
  components: {
    CustomEntrance,
    Parallax
  }
}
</script>

<style lang="less" scoped>
.customItem {
  background-color: var(--bgc);
  .Text {
    padding: 40px 0;
    .customText {
      max-width: 1200px;
      margin: 0 auto;
      padding: 1.25rem 1.875rem;
      font-size: 1.25rem;
      text-indent: 2em;
      line-height: 30px;
      color: var(--navSecondaryColor);
    }
  }
}
.el-pagination {
  padding: 2.5rem 0;
  background-color: var(--bgc);
}
</style>
